MorgothCreator/mSdk/SDK/platform/stm32f7xx/interface/mmcsd_interface.c
/** @addtogroup STM324xG_EVAL_SDIO_SD
  * @brief      This file provides all the SD Card driver firmware functions.
  * @{
  */

/** @defgroup STM324xG_EVAL_SDIO_SD_Private_Types
  * @{
  */
/**
  * @}
  */


/** @defgroup STM324xG_EVAL_SDIO_SD_Private_Defines
  * @{
  */

/**
  * @brief  SDIO Static flags, TimeOut, FIFO Address
  */
//#define NULL 0
//#define SDIO_STATIC_FLAGS               ((unsigned long)0x000005FF)
//#define SDIO_CMD0TIMEOUT                ((unsigned long)0x00010000)

/**
  * @brief  Mask for errors Card Status R1 (OCR Register)
  */
#define SD_OCR_ADDR_OUT_OF_RANGE        ((unsigned long)0x80000000)
#define SD_OCR_ADDR_MISALIGNED          ((unsigned long)0x40000000)
#define SD_OCR_BLOCK_LEN_ERR            ((unsigned long)0x20000000)
#define SD_OCR_ERASE_SEQ_ERR            ((unsigned long)0x10000000)
#define SD_OCR_BAD_ERASE_PARAM          ((unsigned long)0x08000000)
#define SD_OCR_WRITE_PROT_VIOLATION     ((unsigned long)0x04000000)
#define SD_OCR_LOCK_UNLOCK_FAILED       ((unsigned long)0x01000000)
#define SD_OCR_COM_CRC_FAILED           ((unsigned long)0x00800000)
#define SD_OCR_ILLEGAL_CMD              ((unsigned long)0x00400000)
#define SD_OCR_CARD_ECC_FAILED          ((unsigned long)0x00200000)
#define SD_OCR_CC_ERROR                 ((unsigned long)0x00100000)
#define SD_OCR_GENERAL_UNKNOWN_ERROR    ((unsigned long)0x00080000)
#define SD_OCR_STREAM_READ_UNDERRUN     ((unsigned long)0x00040000)
#define SD_OCR_STREAM_WRITE_OVERRUN     ((unsigned long)0x00020000)
//#define SD_OCR_CID_CSD_OVERWRIETE       ((unsigned long)0x00010000)
#define SD_OCR_WP_ERASE_SKIP            ((unsigned long)0x00008000)
#define SD_OCR_CARD_ECC_DISABLED        ((unsigned long)0x00004000)
#define SD_OCR_ERASE_RESET              ((unsigned long)0x00002000)
#define SD_OCR_AKE_SEQ_ERROR            ((unsigned long)0x00000008)
#define SD_OCR_ERRORBITS                ((unsigned long)0xFDFFE008)

/**
  * @brief  Masks for R6 Response
  */
#define SD_R6_GENERAL_UNKNOWN_ERROR     ((unsigned long)0x00002000)
#define SD_R6_ILLEGAL_CMD               ((unsigned long)0x00004000)
#define SD_R6_COM_CRC_FAILED            ((unsigned long)0x00008000)

#define SD_VOLTAGE_WINDOW_SD            ((unsigned long)0x80100000)
#define SD_HIGH_CAPACITY                ((unsigned long)0x40000000)
#define SD_STD_CAPACITY                 ((unsigned long)0x00000000)
//#define SD_CHECK_PATTERN                ((unsigned long)0x000001AA)

#define SD_MAX_VOLT_TRIAL               ((unsigned long)0x0000FFFF)
#define SD_ALLZERO                      ((unsigned long)0x00000000)

#define SD_WIDE_BUS_SUPPORT             ((unsigned long)0x00040000)
#define SD_SINGLE_BUS_SUPPORT           ((unsigned long)0x00010000)
#define SD_CARD_LOCKED                  ((unsigned long)0x02000000)

//#define SD_DATATIMEOUT                  ((unsigned long)0xFFFFFFFF)
#define SD_0TO7BITS                     ((unsigned long)0x000000FF)
#define SD_8TO15BITS                    ((unsigned long)0x0000FF00)
#define SD_16TO23BITS                   ((unsigned long)0x00FF0000)
#define SD_24TO31BITS                   ((unsigned long)0xFF000000)
#define SD_MAX_DATA_LENGTH              ((unsigned long)0x01FFFFFF)

#define SD_HALFFIFO                     ((unsigned long)0x00000008)
#define SD_HALFFIFOBYTES                ((unsigned long)0x00000020)

/**
  * @brief  Command Class Supported
  */
#define SD_CCCC_LOCK_UNLOCK             ((unsigned long)0x00000080)
#define SD_CCCC_WRITE_PROT              ((unsigned long)0x00000040)
#define SD_CCCC_ERASE                   ((unsigned long)0x00000020)

/**
  * @brief  Following commands are SD Card Specific commands.
  *         SDIO_APP_CMD should be sent before sending these commands.
  */
#define SDIO_SEND_IF_COND               ((unsigned long)0x00000008)

/**
  * @}
  */

/** @defgroup STM324xG_EVAL_SDIO_SD_Private_Macros
  * @{
  */
/**
  * @}
  */

/** @defgroup STM324xG_EVAL_SDIO_SD_Private_Variables
  * @{
  */

volatile unsigned long StopCondition = 0;
volatile HAL_SD_ErrorTypedef TransferError = SD_OK;
volatile unsigned long TransferEnd = 0, DMAEndOfTransfer = 0;
//HAL_SD_CardInfoTypedef SDCardInfo[1];

/**
  * @}
  */
FATFS MmcSdFatFs;

#define PATH_BUF_SIZE   6
static char g_cCwdBuf0[PATH_BUF_SIZE] = "SD1:/";

DIR g_sDirObject;

static SD_HandleTypeDef uSdHandle[2];
HAL_SD_CardInfoTypedef uSdCardInfo[2];

Gpio_t *card_detect = NULL;
Gpio_t *status_led = NULL;

static bool card_detected = false;
//Gpio_t *Cs;

/**
  * @brief  Initializes the SD card device.
  * @retval SD status
  */
unsigned char BSP_SD_Init(void)
{
	  uint8_t sd_state = MSD_OK;

	  /* PLLSAI is dedicated to LCD periph. Do not use it to get 48MHz*/

	  /* uSD device interface configuration */
	    uSdHandle[0].Instance = SDMMC2;
	    uSdHandle[0].Init.ClockEdge           = SDMMC_CLOCK_EDGE_RISING;
	    uSdHandle[0].Init.ClockBypass         = SDMMC_CLOCK_BYPASS_DISABLE;
	    uSdHandle[0].Init.ClockPowerSave      = SDMMC_CLOCK_POWER_SAVE_DISABLE;
	    uSdHandle[0].Init.BusWide             = SDMMC_BUS_WIDE_1B;
	    uSdHandle[0].Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
	    uSdHandle[0].Init.ClockDiv            = SDMMC_TRANSFER_CLK_DIV;

	  /* Msp SD Detect pin initialization */
	  //BSP_SD_Detect_MspInit(&uSdHandle[0], NULL);
	  if(BSP_SD_IsDetected() != SD_PRESENT)   /* Check if SD card is present */
	  {
	    return MSD_ERROR_SD_NOT_PRESENT;
	  }

	  /* Msp SD initialization */
	  BSP_SD_MspInit(&uSdHandle[0], NULL);

	  /* HAL SD initialization */
	  if(HAL_SD_Init(&uSdHandle[0], &uSdCardInfo[0]) != SD_OK)
	  {
	    sd_state = MSD_ERROR;
	  }

	  /* Configure SD Bus width */
	  if(sd_state == MSD_OK)
	  {
	    /* Enable wide operation */
	    if(HAL_SD_WideBusOperation_Config(&uSdHandle[0], SDMMC_BUS_WIDE_4B) != SD_OK)
	    {
	      sd_state = MSD_ERROR;
	    }
	    else
	    {
	      sd_state = MSD_OK;
	    }
	  }
	  return  sd_state;
}

/**
  * @brief  DeInitializes the SD card device.
  * @retval SD status
  */
unsigned char BSP_SD_DeInit(void)
{
	  uint8_t sd_state = MSD_OK;

	  uSdHandle[0].Instance = SDMMC2;

