MorgothCreator/mSdk/SDK/platform/stm32f7xx/interface/mmcsd_interface.c
	  /* HAL SD deinitialization */
	  if(HAL_SD_DeInit(&uSdHandle[0]) != HAL_OK)
	  {
	    sd_state = MSD_ERROR;
	  }

	  /* Msp SD deinitialization */
	  uSdHandle[0].Instance = SDMMC2;
	  BSP_SD_MspDeInit(&uSdHandle[0], NULL);

	  return  sd_state;
}

/**
  * @brief  Configures Interrupt mode for SD detection pin.
  * @retval Returns 0
  */
#if 0
uint8_t BSP_SD_ITConfig(void)
{
  GPIO_InitTypeDef gpio_init_structure;

  /* Configure Interrupt mode for SD detection pin */
  gpio_init_structure.Pin = SD_DETECT_PIN;
  gpio_init_structure.Pull = GPIO_PULLUP;
  gpio_init_structure.Speed = GPIO_SPEED_FAST;
  gpio_init_structure.Mode = GPIO_MODE_IT_RISING_FALLING;
  HAL_GPIO_Init(SD_DETECT_GPIO_PORT, &gpio_init_structure);

  /* Enable and set SD detect EXTI Interrupt to the lowest priority */
  HAL_NVIC_SetPriority((IRQn_Type)(SD_DETECT_EXTI_IRQn), 0x0F, 0x00);
  HAL_NVIC_EnableIRQ((IRQn_Type)(SD_DETECT_EXTI_IRQn));

  return MSD_OK;
}
#endif
/**
 * @brief  Detects if SD card is correctly plugged in the memory slot or not.
 * @retval Returns if SD is detected or not
 */
unsigned char BSP_SD_IsDetected(void)
{

	volatile unsigned char status = SD_PRESENT;

	  /*!< Check GPIO to detect SD */
	  if (card_detect != NULL && gpio.in(card_detect) != 0)
	  {
	    status = SD_NOT_PRESENT;
	  }
	  return status;
}



/**
  * @brief  Reads block(s) from a specified address in an SD card, in polling mode.
  * @param  pData: Pointer to the buffer that will contain the data to transmit
  * @param  ReadAddr: Address from where data is to be read
  * @param  BlockSize: SD card data block size, that should be 512
  * @param  NumOfBlocks: Number of SD blocks to read
  * @retval SD status
  */
unsigned char BSP_SD_ReadBlocks(unsigned long *pData, unsigned long long ReadAddr, unsigned long BlockSize, unsigned long NumOfBlocks)
{
  if(HAL_SD_ReadBlocks(&uSdHandle[0], pData, ReadAddr, BlockSize, NumOfBlocks) != SD_OK)
  {
    return MSD_ERROR;
  }
  else
  {
    return MSD_OK;
  }
}

/**
  * @brief  Writes block(s) to a specified address in an SD card, in polling mode.
  * @param  pData: Pointer to the buffer that will contain the data to transmit
  * @param  WriteAddr: Address from where data is to be written
  * @param  BlockSize: SD card data block size, that should be 512
  * @param  NumOfBlocks: Number of SD blocks to write
  * @retval SD status
  */
unsigned char BSP_SD_WriteBlocks(unsigned long *pData, unsigned long long WriteAddr, unsigned long BlockSize, unsigned long NumOfBlocks)
{
  if(HAL_SD_WriteBlocks(&uSdHandle[0], pData, WriteAddr, BlockSize, NumOfBlocks) != SD_OK)
  {
    return MSD_ERROR;
  }
  else
  {
    return MSD_OK;
  }
}

/**
  * @brief  Reads block(s) from a specified address in an SD card, in DMA mode.
  * @param  pData: Pointer to the buffer that will contain the data to transmit
  * @param  ReadAddr: Address from where data is to be read
  * @param  BlockSize: SD card data block size, that should be 512
  * @param  NumOfBlocks: Number of SD blocks to read
  * @retval SD status
  */
unsigned char BSP_SD_ReadBlocks_DMA(unsigned long *pData, unsigned long long ReadAddr, unsigned long BlockSize, unsigned long NumOfBlocks)
{
  unsigned char sd_state = MSD_OK;

  /* Read block(s) in DMA transfer mode */
  if(HAL_SD_ReadBlocks_DMA(&uSdHandle[0], pData, ReadAddr, BlockSize, NumOfBlocks) != SD_OK)
  {
    sd_state = MSD_ERROR;
  }

  /* Wait until transfer is complete */
  if(sd_state == MSD_OK)
  {
    if(HAL_SD_CheckReadOperation(&uSdHandle[0], (unsigned long)SD_DATATIMEOUT) != SD_OK)
    {
      sd_state = MSD_ERROR;
    }
    else
    {
      sd_state = MSD_OK;
    }
  }

  return sd_state;
}

/**
  * @brief  Writes block(s) to a specified address in an SD card, in DMA mode.
  * @param  pData: Pointer to the buffer that will contain the data to transmit
  * @param  WriteAddr: Address from where data is to be written
  * @param  BlockSize: SD card data block size, that should be 512
  * @param  NumOfBlocks: Number of SD blocks to write
  * @retval SD status
  */
unsigned char BSP_SD_WriteBlocks_DMA(unsigned long *pData, unsigned long long WriteAddr, unsigned long BlockSize, unsigned long NumOfBlocks)
{
  unsigned char sd_state = MSD_OK;

  /* Write block(s) in DMA transfer mode */
  if(HAL_SD_WriteBlocks_DMA(&uSdHandle[0], pData, WriteAddr, BlockSize, NumOfBlocks) != SD_OK)
  {
    sd_state = MSD_ERROR;
  }

  /* Wait until transfer is complete */
  if(sd_state == MSD_OK)
  {
    if(HAL_SD_CheckWriteOperation(&uSdHandle[0], (unsigned long)SD_DATATIMEOUT) != SD_OK)
    {
      sd_state = MSD_ERROR;
    }
    else
    {
      sd_state = MSD_OK;
    }
  }

  return sd_state;
}

/**
  * @brief  Erases the specified memory area of the given SD card.
  * @param  StartAddr: Start byte address
  * @param  EndAddr: End byte address
  * @retval SD status
  */
unsigned char BSP_SD_Erase(unsigned long long StartAddr, unsigned long long EndAddr)
{
  if(HAL_SD_Erase(&uSdHandle[0], StartAddr, EndAddr) != SD_OK)
  {
    return MSD_ERROR;
  }
  else
  {
    return MSD_OK;
  }
}

/**
  * @brief  Initializes the SD MSP.
  * @param  hsd: SD handle
  * @param  Params : pointer on additional configuration parameters, can be NULL.
  */
void BSP_SD_MspInit(SD_HandleTypeDef *hsd, void *Params)
{
	  static DMA_HandleTypeDef dma_rx_handle;
	  static DMA_HandleTypeDef dma_tx_handle;
	  GPIO_InitTypeDef gpio_init_structure;

	  /* Enable SDMMC2 clock */
	  __HAL_RCC_SDMMC2_CLK_ENABLE();

	  /* Enable DMA2 clocks */
	  __DMAx_TxRx_CLK_ENABLE();

	  /* Enable GPIOs clock */
	  __HAL_RCC_GPIOB_CLK_ENABLE();
	  __HAL_RCC_GPIOD_CLK_ENABLE();
	  __HAL_RCC_GPIOG_CLK_ENABLE();

	  /* Common GPIO configuration */
	  gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
	  gpio_init_structure.Pull      = GPIO_PULLUP;
	  gpio_init_structure.Speed     = GPIO_SPEED_HIGH;

	  /* GPIOB configuration */
	  gpio_init_structure.Alternate = GPIO_AF10_SDMMC2;
	  gpio_init_structure.Pin = GPIO_PIN_3 | GPIO_PIN_4;
	  HAL_GPIO_Init(GPIOB, &gpio_init_structure);

	  /* GPIOD configuration */
	  gpio_init_structure.Alternate = GPIO_AF11_SDMMC2;
	  gpio_init_structure.Pin = GPIO_PIN_6 | GPIO_PIN_7;
	  HAL_GPIO_Init(GPIOD, &gpio_init_structure);

	  /* GPIOG configuration */
	  gpio_init_structure.Pin = GPIO_PIN_9 | GPIO_PIN_10;
	  HAL_GPIO_Init(GPIOG, &gpio_init_structure);

	  /* NVIC configuration for SDMMC2 interrupts */
	  HAL_NVIC_SetPriority(SDMMC2_IRQn, 5, 0);
	  HAL_NVIC_EnableIRQ(SDMMC2_IRQn);

