MorgothCreator/mSdk/SDK/platform/stm32f7xx/interface/mmcsd_interface.c
unsigned int _mmcsd_write(void *SdStruct, void *ptr, unsigned long block, unsigned int nblks)
{
	//HAL_SD_CardInfoTypedef *_SDCardInfo = (HAL_SD_CardInfoTypedef *)SdStruct;
	//if(!card_detected)
		//return 0;
	if(status_led)
		gpio.out(status_led, 1);
	HAL_SD_ErrorTypedef status = MSD_OK;
	status =  BSP_SD_WriteBlocks_DMA((unsigned long *)ptr, block << 9, 512, nblks);
	if (status == MSD_OK) {
		if(status_led)
			gpio.out(status_led, 0);
		return 1;
	} else {
		if(status_led)
			gpio.out(status_led, 0);
		return 0;
	}
}



bool _mmcsd_idle(unsigned int unit_nr)
{
	if(card_detect != NULL)
	{
		gpio_idle(card_detect);
		if(card_detect->event.state_up)
		{
			card_detect->event.state_up = false;
			card_detected = false;
		}
	}
	if(card_detect == NULL || card_detect->event.state_dn)
	{
		HAL_SD_ErrorTypedef res = SD_OK;
		res =  BSP_SD_Init();
		if(res != SD_OK)
		{
			if(card_detect != NULL)
				card_detect->event.state_dn = false;
			//if(DebugCom)
				//UARTprintf(DebugCom,   "MMCSD%d ERROR initializing card.\n\r" , 0);
			card_detected = false;
			return false;
		}
		if(card_detect != NULL)
			card_detect->event.state_dn = false;
        MmcSdFatFs.drv_rw_func.DriveStruct = (void *)&uSdCardInfo[0];//SdStruct;
        MmcSdFatFs.drv_rw_func.drv_r_func = _mmcsd_read;
        MmcSdFatFs.drv_rw_func.drv_w_func = _mmcsd_write;
#if (_FFCONF == 82786)
        if(!f_mount(2, &MmcSdFatFs))
#else
        if(!f_mount(&MmcSdFatFs,"SD1:", 1))
#endif
        {
                    if(f_opendir(&g_sDirObject, g_cCwdBuf0) == FR_OK)
                    {
#ifdef MMCSD_DEBUG_EN
						if(DebugCom)
						{
							uart.printf(DebugCom,   "MMCSD%d drive %d mounted\n\r" , 0 , 0);
							uart.printf(DebugCom,   "MMCSD%d Fat fs detected\n\r" , 0);
							uart.printf(DebugCom, "MMCSD%d Fs type:                 " , 0);
							if(MmcSdFatFs.fs_type == FS_FAT12)	{
								uart.printf(DebugCom, "Fat12");}
							else if(MmcSdFatFs.fs_type == FS_FAT16){
								uart.printf(DebugCom, "Fat16");}
							else if(MmcSdFatFs.fs_type == FS_FAT32){
								uart.printf(DebugCom, "Fat32");}
							else if(MmcSdFatFs.fs_type == FS_EXFAT){
								uart.printf(DebugCom, "exFat");}
							else								{ 				uart.printf(DebugCom, "None");}
							uart.printf(DebugCom, "\n\r");
																				//UARTprintf(DebugCom, "MMCSD0 BootSectorAddress:       %u \n\r",(unsigned int)g_sFatFs.);
							uart.printf(DebugCom, "MMCSD%d BytesPerSector:          %d \n\r",0, /*(int)g_sFatFs.s_size*/512);
							uart.printf(DebugCom, "MMCSD%d SectorsPerCluster:       %d \n\r",0, (int)MmcSdFatFs.csize);
																				//UARTprintf(DebugCom, "MMCSD0 AllocTable1Begin:        %u \n\r",(unsigned int)g_sFatFs.fatbase);
																				//UARTprintf(DebugCom, "MMCSD%d NumberOfFats:            %d \n\r",0, (int)MmcSdFatFs.n_fats);
																				//UARTprintf(DebugCom, "MMCSD0 MediaType:               %d \n\r",Drives_Table[0]->DiskInfo_MediaType);
																				//UARTprintf(DebugCom, "MMCSD0 AllocTableSize:          %u \n\r",Drives_Table[0]->DiskInfo_AllocTableSize);
																				//UARTprintf(DebugCom, "MMCSD%d DataSectionBegin:        %d \n\r",0, (int)MmcSdFatFs.fatbase);
							uart.printf(DebugCom, "MMCSD%d uSD DiskCapacity:        %uMB\n\r",0, (unsigned long)((unsigned long long)((unsigned long long)MmcSdFatFs.n_fatent * (unsigned long long)/*g_sFatFs.s_size*/512 *(unsigned long long)MmcSdFatFs.csize) / 1000000));
						}
#endif
			        	card_detected = true;
                    } else
                    {
                    	if(DebugCom)										uart.printf(DebugCom,   "MMCSD%d ERROR oppening path\n\r" , 0);
                    	card_detected = false;
                    }
        }
        else
        {
        	if(DebugCom)												uart.printf(DebugCom,   "MMCSD%d ERROR mounting disk\n\r" , 0);
        	card_detected = false;
        }
	}
	return card_detected;
}
/*#####################################################*/

/*-----------------------------------------------------------------------*/
/* Inidialize a Drive                                                    */
/*-----------------------------------------------------------------------*/

void _mmcsd_init(unsigned int unit_nr, new_gpio* CardDetect, new_gpio* StatusLed)
{
	status_led = StatusLed;
	card_detect = CardDetect;
	return;
}
/******************************************************************************/
/*                 STM32F7xx Peripherals Interrupt Handlers                   */
/*  Add here the Interrupt Handler for the used peripheral(s) (PPP), for the  */
/*  available peripheral interrupt handler's name please refer to the startup */
/*  file (startup_stm32f7xx.s).                                               */
/******************************************************************************/

/**
  * @brief  This function handles DMA2 Stream 3 interrupt request.
  * @param  None
  * @retval None
  */
void DMA2_Stream0_IRQHandler(void)
{
  HAL_DMA_IRQHandler(uSdHandle[0].hdmarx);
}

/**
  * @brief  This function handles DMA2 Stream 6 interrupt request.
  * @param  None
  * @retval None
  */
void DMA2_Stream5_IRQHandler(void)
{
  HAL_DMA_IRQHandler(uSdHandle[0].hdmatx);
}

/**
  * @brief  This function handles SDIO interrupt request.
  * @param  None
  * @retval None
  */
void SDMMC2_IRQHandler(void)
{
  HAL_SD_IRQHandler(&uSdHandle[0]);

}


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/*********** Portions COPYRIGHT 2012 Embest Tech. Co., Ltd.*****END OF FILE****/
